# LinkNode Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LinkNode Members
LinkNode Class Methods Properties See Also
---
The LinkNode type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | (Inherited from RenderNode.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetDocument | Returns the document associated with the link. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetTransform | A transformation matrix associated with the node.  (Inherited from GroupNode.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from RenderNode.) |
| NodeName | A readable name of the output node.  (Inherited from RenderNode.) |
| SymbolId | Identifies the Id of the symbol associated with the node. |

# See Also
LinkNode Class
Autodesk.Revit.DB Namespace